test.yml
config:
  plugins:
  publish-metrics:
    - type: datadog
      prefix: "artillery.publish_metrics_plugin."
      tags:
        - "testId:mytest123"
        - "reporterType:datadog-agent"
      event:
        priority: low
        tags:
          - "testId:mytest123"

  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up

scenarios:
  - name: "test"
    flow:
      - get:
          url: "/recipes"
      - think: 2
      - get:
          url: "/recipes/2"